###################################################################

# Created by write_sdc on Wed May 26 12:48:58 2010

###################################################################
set sdc_version 1.7

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_driving_cell -lib_cell SEN_INV_1 [get_ports {A[31]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {A[30]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {A[29]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {A[28]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {A[27]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {A[26]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {A[25]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {A[24]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {A[23]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {A[22]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {A[21]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {A[20]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {A[19]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {A[18]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {A[17]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {A[16]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {A[15]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {A[14]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {A[13]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {A[12]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {A[11]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {A[10]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {A[9]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {A[8]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {A[7]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {A[6]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {A[5]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {A[4]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {A[3]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {A[2]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {A[1]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {A[0]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {B[31]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {B[30]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {B[29]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {B[28]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {B[27]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {B[26]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {B[25]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {B[24]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {B[23]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {B[22]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {B[21]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {B[20]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {B[19]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {B[18]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {B[17]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {B[16]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {B[15]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {B[14]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {B[13]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {B[12]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {B[11]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {B[10]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {B[9]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {B[8]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {B[7]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {B[6]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {B[5]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {B[4]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {B[3]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {B[2]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {B[1]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {B[0]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {INST[3]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {INST[2]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {INST[1]}]
set_driving_cell -lib_cell SEN_INV_1 [get_ports {INST[0]}]
create_clock -name vclk  -period 1.4  -waveform {0 0.5}
set_input_delay -clock vclk  0  [get_ports {A[31]}]
set_input_delay -clock vclk  0  [get_ports {A[30]}]
set_input_delay -clock vclk  0  [get_ports {A[29]}]
set_input_delay -clock vclk  0  [get_ports {A[28]}]
set_input_delay -clock vclk  0  [get_ports {A[27]}]
set_input_delay -clock vclk  0  [get_ports {A[26]}]
set_input_delay -clock vclk  0  [get_ports {A[25]}]
set_input_delay -clock vclk  0  [get_ports {A[24]}]
set_input_delay -clock vclk  0  [get_ports {A[23]}]
set_input_delay -clock vclk  0  [get_ports {A[22]}]
set_input_delay -clock vclk  0  [get_ports {A[21]}]
set_input_delay -clock vclk  0  [get_ports {A[20]}]
set_input_delay -clock vclk  0  [get_ports {A[19]}]
set_input_delay -clock vclk  0  [get_ports {A[18]}]
set_input_delay -clock vclk  0  [get_ports {A[17]}]
set_input_delay -clock vclk  0  [get_ports {A[16]}]
set_input_delay -clock vclk  0  [get_ports {A[15]}]
set_input_delay -clock vclk  0  [get_ports {A[14]}]
set_input_delay -clock vclk  0  [get_ports {A[13]}]
set_input_delay -clock vclk  0  [get_ports {A[12]}]
set_input_delay -clock vclk  0  [get_ports {A[11]}]
set_input_delay -clock vclk  0  [get_ports {A[10]}]
set_input_delay -clock vclk  0  [get_ports {A[9]}]
set_input_delay -clock vclk  0  [get_ports {A[8]}]
set_input_delay -clock vclk  0  [get_ports {A[7]}]
set_input_delay -clock vclk  0  [get_ports {A[6]}]
set_input_delay -clock vclk  0  [get_ports {A[5]}]
set_input_delay -clock vclk  0  [get_ports {A[4]}]
set_input_delay -clock vclk  0  [get_ports {A[3]}]
set_input_delay -clock vclk  0  [get_ports {A[2]}]
set_input_delay -clock vclk  0  [get_ports {A[1]}]
set_input_delay -clock vclk  0  [get_ports {A[0]}]
set_input_delay -clock vclk  0  [get_ports {B[31]}]
set_input_delay -clock vclk  0  [get_ports {B[30]}]
set_input_delay -clock vclk  0  [get_ports {B[29]}]
set_input_delay -clock vclk  0  [get_ports {B[28]}]
set_input_delay -clock vclk  0  [get_ports {B[27]}]
set_input_delay -clock vclk  0  [get_ports {B[26]}]
set_input_delay -clock vclk  0  [get_ports {B[25]}]
set_input_delay -clock vclk  0  [get_ports {B[24]}]
set_input_delay -clock vclk  0  [get_ports {B[23]}]
set_input_delay -clock vclk  0  [get_ports {B[22]}]
set_input_delay -clock vclk  0  [get_ports {B[21]}]
set_input_delay -clock vclk  0  [get_ports {B[20]}]
set_input_delay -clock vclk  0  [get_ports {B[19]}]
set_input_delay -clock vclk  0  [get_ports {B[18]}]
set_input_delay -clock vclk  0  [get_ports {B[17]}]
set_input_delay -clock vclk  0  [get_ports {B[16]}]
set_input_delay -clock vclk  0  [get_ports {B[15]}]
set_input_delay -clock vclk  0  [get_ports {B[14]}]
set_input_delay -clock vclk  0  [get_ports {B[13]}]
set_input_delay -clock vclk  0  [get_ports {B[12]}]
set_input_delay -clock vclk  0  [get_ports {B[11]}]
set_input_delay -clock vclk  0  [get_ports {B[10]}]
set_input_delay -clock vclk  0  [get_ports {B[9]}]
set_input_delay -clock vclk  0  [get_ports {B[8]}]
set_input_delay -clock vclk  0  [get_ports {B[7]}]
set_input_delay -clock vclk  0  [get_ports {B[6]}]
set_input_delay -clock vclk  0  [get_ports {B[5]}]
set_input_delay -clock vclk  0  [get_ports {B[4]}]
set_input_delay -clock vclk  0  [get_ports {B[3]}]
set_input_delay -clock vclk  0  [get_ports {B[2]}]
set_input_delay -clock vclk  0  [get_ports {B[1]}]
set_input_delay -clock vclk  0  [get_ports {B[0]}]
set_input_delay -clock vclk  0  [get_ports {INST[3]}]
set_input_delay -clock vclk  0  [get_ports {INST[2]}]
set_input_delay -clock vclk  0  [get_ports {INST[1]}]
set_input_delay -clock vclk  0  [get_ports {INST[0]}]
set_output_delay -clock vclk  0  [get_ports {Z[31]}]
set_output_delay -clock vclk  0  [get_ports {Z[30]}]
set_output_delay -clock vclk  0  [get_ports {Z[29]}]
set_output_delay -clock vclk  0  [get_ports {Z[28]}]
set_output_delay -clock vclk  0  [get_ports {Z[27]}]
set_output_delay -clock vclk  0  [get_ports {Z[26]}]
set_output_delay -clock vclk  0  [get_ports {Z[25]}]
set_output_delay -clock vclk  0  [get_ports {Z[24]}]
set_output_delay -clock vclk  0  [get_ports {Z[23]}]
set_output_delay -clock vclk  0  [get_ports {Z[22]}]
set_output_delay -clock vclk  0  [get_ports {Z[21]}]
set_output_delay -clock vclk  0  [get_ports {Z[20]}]
set_output_delay -clock vclk  0  [get_ports {Z[19]}]
set_output_delay -clock vclk  0  [get_ports {Z[18]}]
set_output_delay -clock vclk  0  [get_ports {Z[17]}]
set_output_delay -clock vclk  0  [get_ports {Z[16]}]
set_output_delay -clock vclk  0  [get_ports {Z[15]}]
set_output_delay -clock vclk  0  [get_ports {Z[14]}]
set_output_delay -clock vclk  0  [get_ports {Z[13]}]
set_output_delay -clock vclk  0  [get_ports {Z[12]}]
set_output_delay -clock vclk  0  [get_ports {Z[11]}]
set_output_delay -clock vclk  0  [get_ports {Z[10]}]
set_output_delay -clock vclk  0  [get_ports {Z[9]}]
set_output_delay -clock vclk  0  [get_ports {Z[8]}]
set_output_delay -clock vclk  0  [get_ports {Z[7]}]
set_output_delay -clock vclk  0  [get_ports {Z[6]}]
set_output_delay -clock vclk  0  [get_ports {Z[5]}]
set_output_delay -clock vclk  0  [get_ports {Z[4]}]
set_output_delay -clock vclk  0  [get_ports {Z[3]}]
set_output_delay -clock vclk  0  [get_ports {Z[2]}]
set_output_delay -clock vclk  0  [get_ports {Z[1]}]
set_output_delay -clock vclk  0  [get_ports {Z[0]}]
set_output_delay -clock vclk  0  [get_ports {FLAGS[3]}]
set_output_delay -clock vclk  0  [get_ports {FLAGS[2]}]
set_output_delay -clock vclk  0  [get_ports {FLAGS[1]}]
set_output_delay -clock vclk  0  [get_ports {FLAGS[0]}]
